<font size="6" face="verdana" color="green">
    <b>Introdução à Linguagem SQL</b><br>
    <b>DML:</b><i> <b>D</b>ata <b>M</b>anipulation <b>L</b>anguage</i><br>
    <u>Parte 6</u> &mdash; Agrupamentos e agregações</font>
    </font>

<br><br>

**Objetivo:** Explorar comandos básicos da linguagem sub-linguagem de manipulaçào de dados em SQL,\
    usando como exemplo de teste uma <i>toy database</i> que contém dados sobre as mátriculas de 15 alunos:\
    &emsp; &emsp; __a base de Dados `Alunos15`__

__Atividades:__ 
 * Explorar Agrupamentos e agregações:
   * Funções de Agregação
     * Tratamento de nulos em funções de agregação
  * O Comando `GROUP BY`
    * Tratamento de múltiplos atributos de agrupamento
  * A Cláusula `HAVING`
  * A Ordem de Execução dos comandos
  * Um docinho sintático: atributos numerados
   

<br><br>

----

<br>

## 1. Conectar com a Base de Dados

Para começar, sempre é necessário, em cada `Notebook`:
  * Carregar os pacotes que serão usados;
  * Estabelecer a coneção com a base.

In [2]:
# Importar os módulos necessários para o Notebook:
import ipywidgets as widgets     #---
from sqlalchemy import create_engine

# Conectar com um servidor SQL na base Alunos 15 --> Postgres.Alunos15
%load_ext sql

# Connection format: %sql dialect+driver://username:password@host:port/database
engine = create_engine('postgresql://postgres:pgadmin@localhost/alunos15')
%sql postgresql://postgres:postgres@localhost/alunos15

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

<br><br>

----

<br>

## 2 Agrupamentos em SQL

Recordando, a sintaxe geral do comando `SELECT` é:
<div class=”square” style="background-color:#EAF0F0;"><b><font size="3" face="courier" color="blue">
SELECT [<u>ALL</u> | DISTINCT] $<$lista de atributos$>$<br>
   &emsp; FROM $<$lista de Tabelas$>$<br>
   &emsp; [WHERE $<$condições$>$]<br>
       <font color="red">
   &emsp; [GROUP BY $<$lista de atributos><br>
      &emsp; &emsp; [HAVING $<$condição$>$]<br>
      &emsp; &emsp;]<br>
   &emsp; ...;</font></b>
</div>

Neste <i>Notebook</i> será estudada a cláusula `GROUP BY`.\
Ela é opcional, e sempre que usada deve suceder à cláusula `WHERE`.\
Ela atua sobre a (única) relação que é o resultado do processamento que resolve as cláusulas `FROM` e `WHERE`.

<br><br>

----

<br>

<div class=”square” style="background-color:#EAF030;"><font size="3" face="verdana" color="blue">
 Terminologia: <b>Agrupamento</b>
</font></div>
<div class=”square” style="background-color:#E0E0E0;"><font size="3" face="times" color="blue">
É a operação de <b>agrupar</b> subconjuntos de tuplas que tenham o mesmo valor numa determinada expressão sobre seus atributos.
</div>

<br>

<div class=”square” style="background-color:#EAF030;"><font size="3" face="verdana" color="blue">
 Terminologia: <b>Função de Agregação</b>
</font></div>
<div class=”square” style="background-color:#E0E0E0;"><font size="3" face="times" color="blue">
É uma Função que recebe um atributo (singelo ou composto) e retorna <u>um valor</u> que sumariza <u>todos os valores</u> desse atributo<br>
em <u>todas as tuplas da relação</u> de entrada.
</div>

  * Se a função de agregação está no escopo de um comando que não tem uma cláusula `GROUP BY`, \
    então ela age sobre a relação inteira e o resultado tem exatamente uma tupla.
    * Caso contrário, ela age sobre cada grupo gerado pela cláusula `GROUP BY`
       e o resultado tem uma tupla para cada grupo.

<br><br>

----

<br>

## 3. Funções de Agregação na cláusula `SELECT`

O SQL-ISO padroniza uma coleção de funções de agregação básicas, mas cada gerenciador pode acrescentar as suas próprias.

<br>

As <b>Funções de Agregação Padronizadas</b> incluem:
  * <b><font size="3" face="courier" color="blue">
      AVG$($<Param agreg$>$)}</font></b>  &ndash; Retorna a média
  * <b><font size="3" face="courier" color="blue">
	  COUNT(*)</font></b> &ndash; Retorna o número de tuplas no grupo.
  * <b><font size="3" face="courier" color="blue">
	  COUNT($<$Param agreg$>$)</font></b> &ndash; Retorna o número de tuplas distintas ou onde os atributos indicados não são nulos.
  * <b><font size="3" face="courier" color="blue">
	  MAX($<$Param agreg$>$)</font></b> &ndash; Retorna o maior valor encontrado
  * <b><font size="3" face="courier" color="blue">
	  MIN($<$Param agreg$>$)</font></b>  &ndash; Retorna o menor valor encontrado
  * <b><font size="3" face="courier" color="blue">
	  SUM($<$Param agreg$>$)</font></b> &ndash; Retorna a soma dos valores<br>
  Onde:   <b><font size="3" face="courier" color="blue">
    $<$Param agreg$>$ = {`DISTINCT` $<$atributos$>$} | $<$atributos$>$</font><br>
  * Funções que recebem $<$Param agreg$>$ não consideram as tuplas onde esse valor é nulo.
  * $<$Param agreg$>$ é um atributo ou uma lista de atributos e expressões sobre atributos.

<br>

&starf; Exemplo usando apenas __funções de agregação__, sem a cláusula `GROUP BY`:<br>
<i>Listar quantos alunos existem,\
 &emsp; quantos têm idade conhecida, \
 &emsp;  qual a menor e maior idade dentre eles e \
 &emsp; qual a sua média de idade.</i>

In [3]:
%%sql
SELECT Count(*) "Quantos",
       Count(Idade) "Quantos com idade",
       Min(Idade) "Menor idade",
       Max(Idade) "Maior idade", 
       Avg(Idade), /* Para truncar: */   Trunc(Avg(Idade), 2) "Idade média"
    FROM Aluno;

 * postgresql://postgres:***@localhost/alunos15
1 rows affected.

[(15, 13, Decimal('19'), Decimal('35'), Decimal('23.1538461538461538'), Decimal('23.15'))]

Se quizermos contabilizar apenas as tuplas que atendem a determinadas condições, \
podemos usar a cláusula `WHERE`:
Por exemplo:<br>
<i>Considerando apenas alunos de `São Carlos`, listar quantos alunos existem, quantos têm idade conhecida, \
  qual a menor e maior idade dentre eles e qual a sua média de idade?</i>

In [4]:
%%sql
SELECT Count(*) "Quantos",
       Count(Idade) "Quantos com idade",
       Min(Idade) "Menor idade",
       Max(Idade) "Maior idade",
       Trunc(Avg(Idade), 2) "Idade média"
    FROM Aluno
    WHERE Cidade='Sao Carlos';

 * postgresql://postgres:***@localhost/alunos15
1 rows affected.

[(4, 4, Decimal('21'), Decimal('27'), Decimal('23.25'))]


Veja que, por não haver a cláusula `GROUP BY`, o resultado sempre tem uma única tupla.

<br><br>

----

<br>

### 3.1 O tratamento de `Nulos` em funções de agregação

O tratamento de `Nulos` é um fator importante quando se usam funções de agregação.\
Lembrar que a forma correta de comparar procurando atributos que estejam nulos é usar comparações com o operador\
 &emsp;  <b><font size="3" face="courier" color="blue">IS [NOT] NULL</font></b><br><br>

Por exemplo:\
<i>Listar quantos alunos <u>não</u> têm cidade indicada:</i>

In [5]:
%%sql
SELECT Count(*)
    FROM Aluno
    WHERE Cidade IS NULL;

 * postgresql://postgres:***@localhost/alunos15
1 rows affected.

[(2,)]

<br>

As funções que recebem $<$Param agreg$>$ não consideram (descartam) as tuplas onde esse valor é nulo.\
A função <b><font face="courier">Count()</font></b> é a única que adminte a sintaxe:
  * <b><font size="3" face="courier" color="blue">Count(*)</font></b>: contabiliza todas as tuplas que existe, independente de qualquer de seus atributos ser nulo.<br>


Por exemplo:\
<i>Listar quantos alunos existem, quantos têm idade indicada, e quantas idades distintas existem:</i>

In [6]:
%%sql
SELECT Count(*) "Quantos existem",
       Count(idade) "Quantos têm idade",
       Count(distinct idade) "Quantas idades distintas"
    FROM Aluno;

 * postgresql://postgres:***@localhost/alunos15
1 rows affected.

[(15, 13, 9)]

<br><br>
O conceito de `nulos` não faz parte do Modelo Relacional.\
Com isso, não existe um padrão para se trabalhar com núlos, embora tende a existir um 'padrão de fato'.

Por exemplo, se quizermos contabilizar média de idades, assumindo o valor `zero` para quem não tem idade conhecida, podemos perguntar:\
Em Postgres:

In [7]:
%%sql
SELECT AVG(Idade) "Só de idade conhecida",
       AVG(Coalesce(Idade, 0)) "Desconhecido conta zero"
FROM Aluno;

 * postgresql://postgres:***@localhost/alunos15
1 rows affected.

[(Decimal('23.1538461538461538'), Decimal('20.0666666666666667'))]

Em Oracle:

SELECT AVG(Idade), AVG(NVL(Idade,0))\
  FROM Aluno;

A função <b><font size="3" face="courier" color="blue">COALESCE($<$Lista de expressões$>$)</font></b>  em Postgres, \
&emsp; &emsp;   retorna o valor da primeira expressão da lista que não está `nulo`.\
Em nosso exemplo `0` nunca é nulo, portanto se o atributo `Idade` estiver nulo, o resultado é zero, senão é o valor do atributo.

A função  <b><font size="3" face="courier" color="blue">NVL($<$expressão_1, expressão_2$>$) </font></b> em Oracle, \
&emsp; &emsp; retorna o valor da `expressão_1` se ele não estiver  `nulo`, senão retorna o valor da `expressão_2`.

Em ambos os casos, se todas as expressões estiverem `nulas` então a função retorna `nulo` também.

<br><br>

----

<br>

## 4. A cláusula `GROUP BY`

As vezes não se quer <b>agregar</b> <u>todas as tuplas da relação</u>, 
  mas <b>agregar</b> por <b>grupos</b> de <u>tuplas que compartilham o mesmo valor</u> em algum(ns) atributo(s).


A tarefa de agrupamento é especificada pela cláusula `GROUP BY`,\
permitindo que as funções de agregação operem sobre cada grupo gerado.\
&emsp;<font size="3" face="times" color="blue">
Primeiro <b>Agrupa</b>, em seguida <b>Agrega</b>.

A cláusula `GROUP BY` agrupa todas as tuplas da (única) relação resultante das cláusulas `FROM` e `WHERE`,\
e permite calcular atributos agregados sobre cada grupo.

<div class=”square” style="background-color:#EAF0F0;"><b><font size="3" face="courier" color="blue">
SELECT [<u>ALL</u> | DISTINCT] $<$lista de expressões$>$<br>
   &emsp; FROM $<$lista de Tabelas$>$<br>
   &emsp; [WHERE $<$condições$>$]<br>
       <font color="red">
   &emsp; [GROUP BY $<$atributos1$>$[, $<$atributos1$>$, ...]<br>
      &emsp; &emsp; [HAVING $<$condição$>$]<br>
      &emsp; &emsp;]</font></b>
</div>

  * A $<$lista de expressões$>$ pode conter somente atributos que estão listados na cláusula `GROUP BY`\
    e funções de agregação (ou expressões constantes).
  * As condições da cláusula `HAVING` devem ser sobre os atributos agrupados.
  * Funções de Agregação podem ser utilizadas apenas na lista de atributos das cláusulas `SELECT`, `HAVING` e `ORDER BY`.
    * Não podem ser usadas nas cláusulas `WHERE` nem `GROUP BY`.

Por exemplo:\
<i>Listar quantos são os alunos de cada cidade, e qual a menor, a maior e a média das idades de cada cidade:</i>

In [8]:
%%sql
SELECT Cidade,
       Count(*), Min(Idade), Max(Idade), Trunc(Avg(Idade), 2)
    FROM Aluno
    WHERE Cidade IS NOT NULL
    GROUP BY Cidade;

 * postgresql://postgres:***@localhost/alunos15
6 rows affected.

[('Ibate', 1, Decimal('35'), Decimal('35'), Decimal('35.00')),
 ('Campinas', 2, Decimal('19'), Decimal('19'), Decimal('19.00')),
 ('Ibitinga', 1, Decimal('21'), Decimal('21'), Decimal('21.00')),
 ('Araraquara', 3, Decimal('21'), Decimal('22'), Decimal('21.33')),
 ('Sao Carlos', 4, Decimal('21'), Decimal('27'), Decimal('23.25')),
 ('Rio Claro', 2, Decimal('20'), Decimal('25'), Decimal('22.50'))]

Se a cláusula WHERE for omitida e houver tuplas em que o atributo `Cidade` está nulo,\
haverá uma tupla no resultado para indicar isso:

In [9]:
%%sql
SELECT Coalesce(Cidade, '______') "Cidade",
       Count(*), Min(Idade), Max(Idade), Trunc(Avg(Idade), 2)
    FROM Aluno
    GROUP BY Cidade;

 * postgresql://postgres:***@localhost/alunos15
7 rows affected.

[('______', 2, Decimal('24'), Decimal('24'), Decimal('24.00')),
 ('Ibate', 1, Decimal('35'), Decimal('35'), Decimal('35.00')),
 ('Campinas', 2, Decimal('19'), Decimal('19'), Decimal('19.00')),
 ('Ibitinga', 1, Decimal('21'), Decimal('21'), Decimal('21.00')),
 ('Araraquara', 3, Decimal('21'), Decimal('22'), Decimal('21.33')),
 ('Sao Carlos', 4, Decimal('21'), Decimal('27'), Decimal('23.25')),
 ('Rio Claro', 2, Decimal('20'), Decimal('25'), Decimal('22.50'))]

<br><br>

----

<br><br>

## 5. Múltiplos atributos na cláusula `GROUP BY`

Quando existe mais de um atributo na cláusula `GROUP BY`, cria-se um grupo para cada combinação de valores dos atributos.

Por exemplo:\
<i>Listar quantos alunos de cada `Cidade` têm a mesma`Idade`</i>:

In [10]:
%%sql
SELECT Cidade, Idade, Count(*)
    FROM Aluno
    GROUP BY Cidade, Idade;

 * postgresql://postgres:***@localhost/alunos15
14 rows affected.

[('Sao Carlos', Decimal('23'), 1),
 ('Ibate', Decimal('35'), 1),
 ('Campinas', Decimal('19'), 1),
 ('Sao Carlos', Decimal('21'), 1),
 ('Rio Claro', Decimal('25'), 1),
 (None, Decimal('24'), 1),
 ('Rio Claro', Decimal('20'), 1),
 (None, None, 1),
 ('Sao Carlos', Decimal('27'), 1),
 ('Araraquara', Decimal('21'), 2),
 ('Araraquara', Decimal('22'), 1),
 ('Sao Carlos', Decimal('22'), 1),
 ('Campinas', None, 1),
 ('Ibitinga', Decimal('21'), 1)]

<br><br>

----

<br><br>

## 6. A cláusula `HAVING`

As condições colocadas na cláusula `WHERE` se aplicam aos atributos originais existentes nas tabelas-base.\
Mas não pode colocar funções de agregação nessa cláusula, porque enquanto ela estiver sendo processada, os grupos ainda não existem.

Para indicar condições sobre o resultado das funções de agregação existe a (sub-)cláusula `HAVING`, que é subordinada à `GROUP BY`.

A sintaxe é:
<div class=”square” style="background-color:#EAF0F0;"><b><font size="3" face="courier" color="blue">
   &emsp; [GROUP BY $<$atributos1$>$[, $<$atributos1$>$, ...]<br>
       <font color="teal">
      &emsp; &emsp; [HAVING $<$condiçõesAG$>$ ...]</font><br>
      &emsp; &emsp;]</font></b>
</div>

As <b><font size="3" face="courier" color="teal">$<$condiçõesAG$>$</font></b> são avaliadas usando operadores de comparação sobre os grupos depois que eles são formados.

Por exemplo:\
<i>Listar a menor e a maior idade dentre os alunos de cada cidade, das cidades que têm mais de um aluno</i>:

In [11]:
%%sql
SELECT Cidade, Min(Idade), Max(Idade)
FROM Aluno
WHERE Cidade IS NOT NULL
GROUP BY Cidade
HAVING Count(Idade)>1;

 * postgresql://postgres:***@localhost/alunos15
3 rows affected.

[('Araraquara', Decimal('21'), Decimal('22')),
 ('Sao Carlos', Decimal('21'), Decimal('27')),
 ('Rio Claro', Decimal('20'), Decimal('25'))]

A cláusula `HAVING` pode ter diversas comparações, mas sempre usando funções de agregação, nunca diretamente os atributos originais.

Por exemplo:\
<i>Listar a menor e a maior idade dos alunos de cada cidade que têm mais de um aluno,\
    mas incluindo todas as cidades com ao menos um aluno menor de 20 anos</i>:

In [12]:
%%sql
SELECT Cidade, Count(Idade), Min(Idade), Max(Idade)
    FROM Aluno
    WHERE Cidade IS NOT NULL
    GROUP BY Cidade
    HAVING Count(Idade)>1
        OR Min(Idade)<20;

 * postgresql://postgres:***@localhost/alunos15
4 rows affected.

[('Campinas', 1, Decimal('19'), Decimal('19')),
 ('Araraquara', 3, Decimal('21'), Decimal('22')),
 ('Sao Carlos', 4, Decimal('21'), Decimal('27')),
 ('Rio Claro', 2, Decimal('20'), Decimal('25'))]

<font color="red">OBS: Os atributos usados no `HAVING` não necessariamente precisa estar listados na cláusula `SELECT`,\
&emsp; &emsp; mas os atributos das tabelas-base colocados no SELECT têm que estar na cláusula `GROUP BY`.</font>

<br><br>

----

<br><br>

## 7. A Ordem de execução das cláusulas no comando `SELECT`

É interessante saber a ordem com que as cláusulas de um comando `SELECT` são executadas.\
Vamos verificar a ordem de execução quando um comando <u>não tem a cláusula `GROUP BY`:

Veja que, quando o comando termina e o resultado é enviado para o cliente, \
todos os atributos de todas as tabelas=base estão disponíveis para serem selecionados na cláusula `SELECT`\
&emsp; ou qualquer das outras cláusulas posteriores.
<br>

Por exemplo, considere a seguinte consulta:\
<i>Listar os alunos, disciplinas e notas tiradas em turmas que sejam do departamento 'SCE'.</i>

In [13]:
%%sql
SELECT A.Nome, T.Sigla Disciplinas, M.Nota
    FROM Aluno A, Turma T, Matricula M
    WHERE A.NUSP=M.NUSP AND
          M.CodigoTurma=T.Codigo AND
          T.Sigla LIKE 'SCE-%'

 * postgresql://postgres:***@localhost/alunos15
21 rows affected.

[('Carlos', 'SCE-200', Decimal('4')),
 ('Carlos', 'SCE-179', Decimal('8')),
 ('Celso', 'SCE-200', Decimal('7')),
 ('Celso', 'SCE-179', Decimal('9')),
 ('Cicero', 'SCE-200', Decimal('10')),
 ('Cicero', 'SCE-179', Decimal('7')),
 ('Carlitos', 'SCE-200', Decimal('7')),
 ('Carlitos', 'SCE-200', Decimal('4')),
 ('Carlitos', 'SCE-179', Decimal('7')),
 ('Catarina', 'SCE-200', Decimal('8')),
 ('Cibele', 'SCE-200', Decimal('5')),
 ('Corina', 'SCE-200', Decimal('9')),
 ('Celina', 'SCE-200', Decimal('8')),
 ('Celina', 'SCE-179', Decimal('4')),
 ('Celia', 'SCE-200', Decimal('9')),
 ('Celia', 'SCE-179', Decimal('6')),
 ('Cesar', 'SCE-200', Decimal('7')),
 ('Cesar', 'SCE-179', Decimal('9')),
 ('Durval', 'SCE-200', None),
 ('Dora', 'SCE-200', Decimal('0')),
 ('Dina', 'SCE-200', Decimal('0'))]

Veja que todos os atributos das tabelas-base estão disponíveis para serem enviados ao cliente.\
(o `Nome` do `Aluno`, a `Sigla` da `Disciplina`, a `Nota` obtida naquema `Matricula`, etc.)

<br>

<br>

---

<br>

Já quando a cláusula `GROUP BY` é usada, existe uma transformação das tabelas,\
&emsp; &emsp; &emsp; gerando uma nova <b>Tabela Calculada</b>:

Agora, apenas os atributos que foram referenciados na cláusula `GROUP BY` "sobrevivem",\
ao mesmo tempo em que são criados outros atributos: \
&emsp; &emsp; &emsp; um para cada função de agregação mencionada nas cláusulas `SELECT` ou `HAVING`.

<br>

Por exemplo:
<i>Listar a média das `Notas` das `Disciplinas` em `Turmas` com <u>mais de 10 alunos matriculados</u></i>.

<br>

In [14]:
%%sql
SELECT T.Sigla, AVG(M.Nota)
    FROM Turma T, Matricula M
    WHERE M.CodigoTurma=T.Codigo
    GROUP BY T.sigla
    HAVING Count(*)>10;

 * postgresql://postgres:***@localhost/alunos15
2 rows affected.

[('SCE-200', Decimal('6.0000000000000000')),
 ('SMA-179', Decimal('6.7333333333333333'))]

Veja que agora estão disponíveis apenas:
  * os atributos listados na cláusula `GROUP BY`: <b><font size="3" face="courier" color="blue">Turma.Sigla</font></b>,
  *  <font size="5">&#9758;</font> e os atributos gerados pelas funções de agregação:<b><font size="3" face="courier" color="blue"> AVG(M.Nota), Count(*), ...</font></b>

De fato, não faria sentido pedir qualquer outro atributo-base.\
Por exemplo se fosse pedida a `Nota` individual de cada aluno, não teria sentido ela aparecer junto com uma tupla que se refere à `Sigla` como um todo...

<br><br>

----

<br><br>

## 8. Um docinho sintático

Dado um comando `SELECT`:
<div class=”square” style="background-color:#EAF0F0;"><b><font size="3" face="courier" color="blue">
SELECT <font color="red">$A_1$</font><br>
   &emsp; FROM <font color="green">$R$</font><br>
   &emsp; [WHERE <font color="cyan">$C_1$</font>]<br>
   &emsp; [GROUP BY <font color="cyan">$A_2$</font><br>
      &emsp; &emsp; [HAVING <font color="cyan">$C_1$</font>]<br>
   &emsp; [ORDER BY <font color="red">$A_3$</font>]<br>
   &emsp; ...;</font></b>
</div>

  * Embora a execução do comando comece processando a lista de relações <font color="green" size="4">$R$</font> da cláusula `FROM`,\
    &emsp; <font size="5">&#9758;</font> a análise sintática começa processando a lista de atributos <font color="red" size="4">$A_1$</font>.
  * Assim, cada elemento da lista <font color="red" size="4">$A_1$</font> fica numerada,\
    <font color="magenta" size="3">e as listas de atributos seguintes podem se referenciar a eles pelo seu número ordinal.</font>

Por exemplo:\
<i>Liste quantos alunos são de cada cidade e idade, ordenando pela idade e pelo nome da cidade entre os que têm mesma idade.</i>

In [15]:
%%sql
SELECT Cidade, Idade, Count(*)
    FROM Aluno
    GROUP BY 1, 2
    ORDER BY 2, 3;

 * postgresql://postgres:***@localhost/alunos15
14 rows affected.

[('Campinas', Decimal('19'), 1),
 ('Rio Claro', Decimal('20'), 1),
 ('Sao Carlos', Decimal('21'), 1),
 ('Ibitinga', Decimal('21'), 1),
 ('Araraquara', Decimal('21'), 2),
 ('Sao Carlos', Decimal('22'), 1),
 ('Araraquara', Decimal('22'), 1),
 ('Sao Carlos', Decimal('23'), 1),
 (None, Decimal('24'), 1),
 ('Rio Claro', Decimal('25'), 1),
 ('Sao Carlos', Decimal('27'), 1),
 ('Ibate', Decimal('35'), 1),
 (None, None, 1),
 ('Campinas', None, 1)]

é equivalente a:

In [16]:
%%sql
SELECT Cidade, Idade, Count(*)
    FROM Aluno
    GROUP BY Cidade, Idade
    ORDER BY Idade, Count(*);

 * postgresql://postgres:***@localhost/alunos15
14 rows affected.

[('Campinas', Decimal('19'), 1),
 ('Rio Claro', Decimal('20'), 1),
 ('Sao Carlos', Decimal('21'), 1),
 ('Ibitinga', Decimal('21'), 1),
 ('Araraquara', Decimal('21'), 2),
 ('Sao Carlos', Decimal('22'), 1),
 ('Araraquara', Decimal('22'), 1),
 ('Sao Carlos', Decimal('23'), 1),
 (None, Decimal('24'), 1),
 ('Rio Claro', Decimal('25'), 1),
 ('Sao Carlos', Decimal('27'), 1),
 ('Ibate', Decimal('35'), 1),
 (None, None, 1),
 ('Campinas', None, 1)]

<br><br>

----

<br><br>

Outro exemplo:\
<i>Liste quantos alunos são de São Carlos e quantos não são.</i>

In [17]:
%%sql
SELECT Cidade='Sao Carlos' AS "de SCarlos",
       Count(*)
    FROM Aluno
    GROUP BY 1;

 * postgresql://postgres:***@localhost/alunos15
3 rows affected.

[(None, 2), (False, 9), (True, 4)]

é equivalente, mas bem mais sucinto, do que:

In [18]:
%%sql
SELECT Cidade='Sao Carlos' AS "de SCarlos",
       Count(*)
    FROM Aluno
    GROUP BY Cidade='Sao Carlos';

 * postgresql://postgres:***@localhost/alunos15
3 rows affected.

[(None, 2), (False, 9), (True, 4)]

<br><br>

----

<br><br>

Suponha que só queremos saber quais são os alunos <b>sabidamente</b> de São Carlos:

In [19]:
%%sql
SELECT CASE WHEN Cidade= 'Sao Carlos' THEN 'SIM'
            ELSE 'Não' 
            END AS "de SCarlos",
        Count(*)
    FROM Aluno
    GROUP BY 1;

 * postgresql://postgres:***@localhost/alunos15
2 rows affected.

[('Não', 11), ('SIM', 4)]

Compare com o comando equivalente:

In [20]:
%%sql
SELECT CASE WHEN Cidade= 'Sao Carlos' THEN 'SIM'
            ELSE 'Não' 
            END AS "de SCarlos",
        Count(*)
    FROM Aluno
    GROUP BY CASE WHEN Cidade= 'Sao Carlos' THEN 'SIM'
                  ELSE 'Não' 
                  END;

 * postgresql://postgres:***@localhost/alunos15
2 rows affected.

[('Não', 11), ('SIM', 4)]

  * A sequências das operações de finalização da consulta segundo o padrão SQL deve ser:\
    &emsp; <font size="6">&#9758;</font> 
			<font size="4" color="blue" face=courier><b> GROUP </b></font> $\rightarrow$ 
			<font size="4" color="blue" face=courier><b> HAVING </b></font> $\rightarrow$ 
			<font size="4" face=verdana><b> (funções em <font size="5" color="red"> $\pi_{\{A_i\}}$</font>) </b></font> $\rightarrow$ 
			<font size="4" color="blue" face=courier><b> DISTINCT </b></font> $\rightarrow$ 
			<font size="4" color="blue" face=courier><b> ORDER BY</b></font> $\rightarrow$ 
			<font size="4" color="blue" face=courier><b> LIMIT </b></font> $\rightarrow$ 
			<b><font face=verdana size="5" color="red">$\pi_{\{A_i\}}$ </font></b>
   
  * <font face="times"> No entanto, a partir do padrão `SQL:2003`, quando as `window functions` foram padronizadas,\
     essa sequência passou a ser questionada, e cada SGBD define sequências de maneira diferente,\
     ou até variáveis (sequencias que dependem da estrutura de cada comando), dos atributos e das funções que ocorrem no comando\
     (especialmente quando existem <u>funções que retornam relações</u></font>
  * Veja o manual do SGBD que você está usando!

<br><br>

----

<br><br>